<?php

/**
 * Transliteration data for Belarusian (BE)
 *
 * Data taken from http://en.wikipedia.org/wiki/Romanization_of_Belarusian,
 * column "British".
 *
 * @package translit
 * @author  Alexey Shtokalo <alexey@shtokalo.net>
 */

return array (
    // upper case
    'А'  => 'A',   'Б'  => 'B',   'В'  => 'V',   'Г'  => 'H',
    'Ґ'  => 'G',   'ДЖ' => 'Dhz', 'Дж' => 'Dhz', 'ДЗ' => 'Dz',
    'Дз' => 'Dz',  'Д'  => 'D',   'Е'  => 'E',   'Ё'  => 'Ë',
    'Ж'  => 'Zh',  'З'  => 'Z',   'І'  => 'I',   'Й'  => 'Ĭ',
    'К'  => 'K',   'Л'  => 'L',   'М'  => 'M',   'Н'  => 'N',
    'О'  => 'O',   'П'  => 'P',   'Р'  => 'R',   'С'  => 'S',
    'ТС' => 'T-s', 'Тс' => 'T-s', 'Т'  => 'T',   'У'  => 'U',
    'Ў'  => 'W',   'Ф'  => 'F',   'Х'  => 'Kh',  'Ц'  => 'Ts',
    'Ч'  => 'Ch',  'Ш'  => 'Sh',  '’'  => ', ',  'Ы'  => 'Ȳ',
    'Ь'  => '',    'Э'  => 'É',   'Ю'  => 'Yu',  'Я'  => 'Ya',
    // lower case
    'а'  => 'a',   'б'  => 'b',   'в'  => 'v',   'г'  => 'h',
    'ґ'  => 'g',   'дж' => 'dhz', 'дз' => 'dz',  'д'  => 'd',
    'е'  => 'e',   'ё'  => 'ë',   'ж'  => 'zh',  'з'  => 'z',
    'і'  => 'i',   'й'  => 'ĭ',   'к'  => 'k',   'л'  => 'l',
    'м'  => 'm',   'н'  => 'n',   'о'  => 'o',   'п'  => 'p',
    'р'  => 'r',   'с'  => 's',   'тс' => 't-s', 'т'  => 't',
    'у'  => 'u',   'ў'  => 'w',   'ф'  => 'f',   'х'  => 'kh',
    'ц'  => 'ts',  'ч'  => 'ch',  'ш'  => 'sh',  'ы'  => 'ȳ',
    'ь'  => '',    'э'  => 'é',   'ю'  => 'yu',  'я'  => 'ya',
);
