<?php

/**
 * Transliteration data for Kazakh (KK)
 *
 * Data taken from http://en.wikipedia.org/wiki/BGN/PCGN_romanization_of_Kazakh,
 * column "Romanization".
 *
 * @author Alexey Shtokalo <alexey@shtokalo.net>
 */

return array (
    // upper case
    'А' => 'A',     'Ә' => 'Ä',     'Б' => 'B',     'В' => 'V',
    'Г' => 'G',     'Ғ' => 'Gh',    'Д' => 'D',     'Е' => 'E',
    'Ё' => 'Yo',    'Ж' => 'Zh',    'З' => 'Z',     'И' => 'Ī',
    'Й' => 'Y',     'К' => 'K',     'Қ' => 'Q',     'Л' => 'L',
    'М' => 'M',     'Н' => 'N',     'Ң' => 'Ng',    'О' => 'O',
    'Ө' => 'Ö',     'П' => 'P',     'Р' => 'R',     'С' => 'S',
    'Т' => 'T',     'У' => 'Ū',     'Ұ' => 'U',     'Ү' => 'Ü',
    'Ф' => 'F',     'Х' => 'Kh',    'Һ' => 'H',     'Ц' => 'Ts',
    'Ч' => 'Ch',    'Ш' => 'Sh',    'Щ' => 'Shch',  'Ъ' => '”',
    'Ы' => 'Y',     'І' => 'I',     'Ь' => '’',     'Э' => 'Ė',
    'Ю' => 'Yu',    'Я' => 'Ya',
    // lower case
    'а' => 'a',     'ә' => 'ä',     'б' => 'b',     'в' => 'v',
    'г' => 'g',     'ғ' => 'gh',    'д' => 'd',     'е' => 'e',
    'ё' => 'yo',    'ж' => 'zh',    'з' => 'z',     'и' => 'ī',
    'й' => 'y',     'к' => 'k',     'қ' => 'q',     'л' => 'l',
    'м' => 'm',     'н' => 'n',     'ң' => 'ng',    'о' => 'o',
    'ө' => 'ö',     'п' => 'p',     'р' => 'r',     'с' => 's',
    'т' => 't',     'у' => 'ū',     'ұ' => 'u',     'ү' => 'ü',
    'ф' => 'f',     'х' => 'kh',    'һ' => 'h',     'ц' => 'ts',
    'ч' => 'ch',    'ш' => 'sh',    'щ' => 'shch',  'ъ' => '”',
    'ы' => 'y',     'і' => 'i',     'ь' => '’',     'э' => 'ė',
    'ю' => 'yu',    'я' => 'ya',
);
